Captain97r/MiniCopter_STM32F103/Src/mag_caibration.c
#include <math.h>
#include <string.h>
#include <float.h>
#include "stm32f1xx_hal.h"

#include "mag_calibration.h"
#include "MPU9250.h"

 
// Forward declarations of mymathlib.com routines
void Matrix_x_Its_Transpose(float *C, float *A, int nrows, int ncols)
{
	int i, j, k;
	float *pAi0 = A;
	float *pAj0;
	float *pCi0 = C;
	float *pCji;

	for (i = 0; i < nrows; pCi0 += nrows, pAi0 += ncols, i++) {
		pCji = pCi0 + i;
		pAj0 = pAi0; 
		for (j = i; j < nrows; pCji += nrows, j++) {
			*(pCi0 + j) = 0.0; 
			for (k = 0; k < ncols; k++) *(pCi0 + j) += *(pAi0 + k) * *pAj0++;
			*pCji = *(pCi0 + j);
		}
	}
}

void Get_Submatrix(float *S,
	int mrows,
	int mcols, 
	float *A,
	int ncols,
	int row,
	int col)
{
	int number_of_bytes = sizeof(float) * mcols;

	for (A += row * ncols + col; mrows > 0; A += ncols, S += mcols, mrows--) 
		memcpy(S, A, number_of_bytes);
}

int Choleski_LU_Decomposition(float *A, int n)
{
	int i, k, p;
	float *p_Lk0;                    // pointer to L[k][0]
	float *p_Lkp;                    // pointer to L[k][p]  
	float *p_Lkk;                    // pointer to diagonal element on row k.
	float *p_Li0;                    // pointer to L[i][0]
	float reciprocal;

	for (k = 0, p_Lk0 = A; k < n; p_Lk0 += n, k++) {
           
		//            Update pointer to row k diagonal element.   

		      p_Lkk = p_Lk0 + k;

		//            Calculate the difference of the diagonal element in row k
		//            from the sum of squares of elements row k from column 0 to 
		//            column k-1.

		      for(p = 0, p_Lkp = p_Lk0 ; p < k ; p_Lkp += 1, p++)
		         *p_Lkk -= *p_Lkp * *p_Lkp;

		//            If diagonal element is not positive, return the error code,
		//            the matrix is not positive definite symmetric.

		      if(*p_Lkk <= 0.0) return - 1;

		//            Otherwise take the square root of the diagonal element.

		      *p_Lkk = sqrt(*p_Lkk);
		reciprocal = 1.0 / *p_Lkk;

		//            For rows i = k+1 to n-1, column k, calculate the difference
		//            between the i,k th element and the inner product of the first
		//            k-1 columns of row i and row k, then divide the difference by
		//            the diagonal element in row k.
		//            Store the transposed element in the upper triangular matrix.

		      p_Li0 = p_Lk0 + n;
		for (i = k + 1; i < n; p_Li0 += n, i++) {
			for (p = 0; p < k; p++)
				*(p_Li0 + k) -= *(p_Li0 + p) * *(p_Lk0 + p);
			*(p_Li0 + k) *= reciprocal;
			*(p_Lk0 + i) = *(p_Li0 + k);
		}  
	}
	return 0;
}

int Lower_Triangular_Inverse(float *L, int n)
{
	int i, j, k;
	float *p_i, *p_j, *p_k;
	float sum;

	//         Invert the diagonal elements of the lower triangular matrix L.

	   for(k = 0, p_k = L ; k < n ; p_k += (n + 1), k++) {
		if (*p_k == 0.0) return -1;
		else *p_k = 1.0 / *p_k;
	}

	//         Invert the remaining lower triangular matrix L row by row.

	   for(i = 1, p_i = L + n ; i < n ; i++, p_i += n) {
		for (j = 0, p_j = L; j < i; p_j += n, j++) {
			sum = 0.0;
			for (k = j, p_k = p_j; k < i; k++, p_k += n)
				sum += *(p_i + k) * *(p_k + j);
			*(p_i + j) = -*(p_i + i) * sum;
		}
	}
  
	return 0;
}


int Choleski_LU_Inverse(float *LU, int n)
{
	int i, j, k;
	float *p_i, *p_j, *p_k;
	float sum;

	if (Lower_Triangular_Inverse(LU, n) < 0) return -1;
  
	//         Premultiply L inverse by the transpose of L inverse.      

	   for(i = 0, p_i = LU ; i < n ; i++, p_i += n) {
		for (j = 0, p_j = LU; j <= i; j++, p_j += n) {
			sum = 0.0;
			for (k = i, p_k = p_i; k < n; k++, p_k += n)
				sum += *(p_k + i) * *(p_k + j);
			*(p_i + j) = sum;
			*(p_j + i) = sum;
		}
	}
  
	return 0;
}
void Multiply_Matrices(float *C, float *A, int nrows, int ncols, float *B, int mcols) 
{
	float *pB;
	float *p_B;
	int i, j, k;

	for (i = 0; i < nrows; A += ncols, i++) 
		for (p_B = B, j = 0; j < mcols; C++, p_B++, j++) {
			pB = p_B;
			*C = 0.0; 
			for (k = 0; k < ncols; pB += mcols, k++) 
				*C += *(A + k) * *pB;
		}
}

void Identity_Matrix(float *A, int n)
{
	int i, j;

	for (i = 0; i < n - 1; i++) {
		*A++ = 1.0;
		for (j = 0; j < n; j++) *A++ = 0.0;
	} 
	*A = 1.0;
}

void Copy_Vector(float *d, float *s, int n)
{
	memcpy(d, s, sizeof(float) * n);
}

static void Hessenberg_Elementary_Transform(float *H,
	float* S,
	int perm[],
	int n)
{
	int i, j;
	float *pS, *pH;
	float x;

	Identity_Matrix(S, n);
	for (i = n - 2; i >= 1; i--) {
		pH = H + n * (i + 1);
		pS = S + n * (i + 1);
		for (j = i + 1; j < n; pH += n, pS += n, j++) {
			*(pS + i) = *(pH + i - 1);
			*(pH + i - 1) = 0.0;
		}
		if (perm[i] != i) {
			pS = S + n * i;
			pH = S + n * perm[i];
			for (j = i; j < n; j++) {
				*(pS + j) = *(pH + j);
				*(pH + j) = 0.0;
			}
			*(pH + i) = 1.0;
		}
	}
}

void Interchange_Rows(float *A, int row1, int row2, int ncols)
{
	int i;
	float *pA1, *pA2;
	float temp;

	pA1 = A + row1 * ncols;
	pA2 = A + row2 * ncols;
	for (i = 0; i < ncols; i++) {
		temp = *pA1;
		*pA1++ = *pA2;
		*pA2++ = temp;
	}
}

void Interchange_Columns(float *A, int col1, int col2, int nrows, int ncols)
{
	int i;
	float *pA1, *pA2;
	float temp;

	pA1 = A + col1;
	pA2 = A + col2;
	for (i = 0; i < nrows; pA1 += ncols, pA2 += ncols, i++) {
		temp = *pA1;
		*pA1 = *pA2;
		*pA2 = temp;
	}
}
 
int Hessenberg_Form_Elementary(float *A, float* S, int n)
{
	int i, j, k, col, row;
	int perm[n * sizeof(int)];
	float *p_row, *pS_row;
	float max;
	float s;
	float *pA, *pB, *pC, *pS;

	// n x n matrices for which n <= 2 are already in Hessenberg form

	if(n <= 1) { *S = 1.0; return 0; }
	if (n == 2) { *S++ = 1.0; *S++ = 0.0; *S++ = 1.0; *S = 0.0; return 0; }

	// Allocate working memory

	//perm = (int*) malloc(n * sizeof(int));
	//if (perm == NULL) return -1;             // not enough memory

	        // For each column use Elementary transformations 
	        //   to zero the entries below the subdiagonal.

	p_row = A + n;
	pS_row = S + n;
	for (col = 0; col < (n - 2); p_row += n, pS_row += n, col++) {

		// Find the row in column "col" with maximum magnitude where 
		// row >= col + 1.                
     
	row = col + 1;
		perm[row] = row;
		for (pA = p_row + col, max = 0.0, i = row; i < n; pA += n, i++)
			if (fabs(*pA) > max) { perm[row] = i; max = fabs(*pA); }
      
