Captain97r/MiniCopter_STM32F103/Src/mag_caibration.c
		// If perm[row] != row, then interchange row "row" and row
		// perm[row] and interchange column "row" and column perm[row].

	if(perm[row] != row) {
			Interchange_Rows(A, row, perm[row], n);
			Interchange_Columns(A, row, perm[row], n, n);
		}
         
		// Zero out the components lying below the subdiagonal.

	pA = p_row + n;
		pS = pS_row + n;
		for (i = col + 2; i < n; pA += n, pS += n, i++) {
			s = *(pA + col) / *(p_row + col);
			for (j = 0; j < n; j++) 
				*(pA + j) -= *(p_row + j) * s;
			*(pS + col) = s;
			for (j = 0, pB = A + col + 1, pC = A + i; j < n; pB += n, pC += n, j++) 
				*pB += s * *pC;
		}
	}
	pA = A + n + n;
	pS = S + n + n;
	for (i = 2; i < n; pA += n, pS += n, i++) Copy_Vector(pA, pS, i - 1);

	Hessenberg_Elementary_Transform(A, S, perm, n);
   
	return 0;
}

static void Product_and_Sum_of_Shifts(float *H,
	int n,
	int max_row,
	float* shift,
	float *trace,
	float *det,
	int iteration) 
{
	float *pH = H + max_row * n;
	float *p_aux;
	int i;
	int min_col = max_row - 1;

	if ((iteration % 10) == 0) {
		*shift += pH[max_row];
		for (i = 0, p_aux = H; i <= max_row; p_aux += n, i++)
			p_aux[i] -= pH[max_row];
		p_aux = pH - n;
		*trace = fabs(pH[min_col]) + fabs(p_aux[min_col - 1]);
		*det = *trace * *trace;
		*trace *= 1.5;
	}
	else {
		p_aux = pH - n;
		*trace = p_aux[min_col] + pH[max_row];
		*det = p_aux[min_col] * pH[max_row] - p_aux[max_row] * pH[min_col];
	}
}

static int Two_Consecutive_Small_Subdiagonal(float* H, int min_row,
                                 int max_row, int n, float trace, float det)
{
   float x, y ,z, s;
   float* pH;
   int i, k;

   for (k = max_row - 2, pH = H + k * n; k >= min_row; pH -= n, k--) {
      x = (pH[k] * ( pH[k] - trace ) + det) / pH[n+k] + pH[k+1];
      y = pH[k] + pH[n+k+1] - trace;
      z = pH[n + n + k + 1];
      s = fabs(x) + fabs(y) + fabs(z);
      x /= s;
      y /= s;
      z /= s;
      if (k == min_row) break;
      if ( (fabs(pH[k-1]) * (fabs(y) + fabs(z)) ) <= 
          DBL_EPSILON * fabs(x) *
             (fabs(pH[k-1-n]) + fabs(pH[k]) + fabs(pH[n + k + 1])) ) break; 
   }
   for (i = k+2, pH = H + i * n; i <= max_row; pH += n, i++) pH[i-2] = 0.0;
   for (i = k+3, pH = H + i * n; i <= max_row; pH += n, i++) pH[i-3] = 0.0;
   return k;
};

static void Update_Row(float *Hrow, float cos, float sin, int n, int row)
{
	float x;
	float *Hnextrow = Hrow + n;
	int i;

	for (i = row; i < n; i++) {
		x = Hrow[i];
		Hrow[i] = cos * x + sin * Hnextrow[i];
		Hnextrow[i] = cos * Hnextrow[i] - sin * x;
	}
}

static void Update_Column(float* H, float cos, float sin, int n, int col)
{
	float x;
	int i;
	int next_col = col + 1;

	for (i = 0; i <= next_col; i++, H += n) {
		x = H[col];
		H[col] = cos * x + sin * H[next_col];
		H[next_col] = cos * H[next_col] - sin * x;
	}
}

static void Update_Transformation(float *S,
	float cos,
	float sin,
	int n,
	int k)
{
	float x;
	int i;
	int k1 = k + 1;

	for (i = 0; i < n; i++, S += n) {
		x = S[k];
		S[k] = cos * x + sin * S[k1];
		S[k1] = cos * S[k1] - sin * x;
	}
}

static void float_QR_Step(float *H,
	int min_row,
	int max_row,
	int min_col,
	float trace,
	float det,
	float *S,
	int n)
{
	float s, x, y, z;
	float a, b, c;
	float *pH;
	float *tH;
	float *pS;
	int i, j, k;
	int last_test_row_col = max_row - 1;

	k = min_col;
	pH = H + min_col * n;
	a = (pH[k] * (pH[k] - trace) + det) / pH[n + k] + pH[k + 1];
	b = pH[k] + pH[n + k + 1] - trace;
	c = pH[n + n + k + 1];
	s = fabs(a) + fabs(b) + fabs(c);
	a /= s;
	b /= s;
	c /= s;

	for (; k <= last_test_row_col; k++, pH += n) {
		if (k > min_col) {
			c = (k == last_test_row_col) ? 0.0 : pH[n + n + k - 1];
			x = fabs(pH[k - 1]) + fabs(pH[n + k - 1]) + fabs(c);
			if (x == 0.0) continue;
			a = pH[k - 1] / x;
			b = pH[n + k - 1] / x;
			c /= x;
		}
		s = sqrt(a * a + b * b + c * c);
		if (a < 0.0) s = -s;
		if (k > min_col) pH[k - 1] = -s * x;
		else if (min_row != min_col) pH[k - 1] = -pH[k - 1];
		a += s;
		x = a / s;
		y = b / s;
		z = c / s;
		b /= a;
		c /= a;

		// Update rows k, k+1, k+2
for(j = k ; j < n ; j++) {
			a = pH[j] + b * pH[n + j];
			if (k != last_test_row_col) {
				a += c * pH[n + n + j];
				pH[n + n + j] -= a * z;
			}
			pH[n + j] -= a * y;
			pH[j] -= a * x;
		}

		// Update column k+1

j = k + 3;
		if (j > max_row) j = max_row;
		for (i = 0, tH = H; i <= j; i++, tH += n) {
			a = x * tH[k] + y * tH[k + 1];
			if (k != last_test_row_col) {
				a += z * tH[k + 2];
				tH[k + 2] -= a * c;
			}
			tH[k + 1] -= a * b;
			tH[k] -= a;           
		}

		// Update transformation matrix

for(i = 0, pS = S ; i < n ; pS += n, i++) {
			a = x * pS[k] + y * pS[k + 1];
			if (k != last_test_row_col) {
				a += z * pS[k + 2];
				pS[k + 2] -= a * c;
			}
			pS[k + 1] -= a * b;
			pS[k] -= a;
		}
	}
	; 
} 

static void float_QR_Iteration(float *H,
	float *S,
	int min_row,
	int max_row,
	int n,
	float* shift,
	int iteration) 
{
	int k;
	float trace, det;

	Product_and_Sum_of_Shifts(H, n, max_row, shift, &trace, &det, iteration);
	k = Two_Consecutive_Small_Subdiagonal(H, min_row, max_row, n, trace, det);
	float_QR_Step(H, min_row, max_row, k, trace, det, S, n);
}


static void One_Real_Eigenvalue(float Hrow[],
	float eigen_real[],
	float eigen_imag[],
	int row,
	float shift)
{
	Hrow[row] += shift;      
	eigen_real[row] = Hrow[row];
	eigen_imag[row] = 0.0;
}

static void Two_Eigenvalues(float *H,
	float* S,
	float eigen_real[],
	float eigen_imag[],
	int n,
	int row,
	float shift)
{
	float p, q, x, discriminant, r;
	float cos, sin;
	float *Hrow = H + n * row;
	float *Hnextrow = Hrow + n;
	int nextrow = row + 1;

	p = 0.5 * (Hrow[row] - Hnextrow[nextrow]);
	x = Hrow[nextrow] * Hnextrow[row];
	discriminant = p * p + x;
	Hrow[row] += shift;
	Hnextrow[nextrow] += shift;
	if (discriminant > 0.0) {
		                 // pair of real roots
	   q = sqrt(discriminant);
		if (p < 0.0) q = p - q;
		else q += p;
		eigen_real[row] = Hnextrow[nextrow] + q;
		eigen_real[nextrow] = Hnextrow[nextrow] - x / q;
		eigen_imag[row] = 0.0;
		eigen_imag[nextrow] = 0.0;
		r = sqrt(Hnextrow[row]*Hnextrow[row] + q * q);
		sin = Hnextrow[row] / r;
		cos = q / r;
		Update_Row(Hrow, cos, sin, n, row);
		Update_Column(H, cos, sin, n, row);
		Update_Transformation(S, cos, sin, n, row);
	}
	else {
		                             // pair of complex roots
	   eigen_real[nextrow] = eigen_real[row] = Hnextrow[nextrow] + p;
		eigen_imag[row] = sqrt(fabs(discriminant));
		eigen_imag[nextrow] = -eigen_imag[row];
	}
}

static void BackSubstitute_Real_Vector(float *H,
	float eigen_real[],
	float eigen_imag[],
	int row,
	float zero_tolerance,
	int n)
{
	float *pH;
	float *pV;
	float x, y;
	float u[4];
	float v[2];
	int i, j, k;

