Captain97r/MiniCopter_STM32F103/Src/mag_caibration.c
	k = row;
	pH = H + row * n;
	pH[row] = 1.0;
	for (i = row - 1, pH -= n; i >= 0; i--, pH -= n) {
		u[0] = pH[i] - eigen_real[row];
		v[0] = pH[row];
		pV = H + n * k;
		for (j = k; j < row; j++, pV += n) v[0] += pH[j] * pV[row];
		if (eigen_imag[i] < 0.0) {
			u[3] = u[0];
			v[1] = v[0];
		}
		else {
			k = i;
			if (eigen_imag[i] == 0.0) {
				if (u[0] != 0.0) pH[row] = -v[0] / u[0];
				else pH[row] = -v[0] / zero_tolerance;
			}
			else {
				u[1] = pH[i + 1];
				u[2] = pH[n + i];
				x = (eigen_real[i] - eigen_real[row]);
				x *= x;
				x += eigen_imag[i] * eigen_imag[i];
				pH[row] = (u[1] * v[1] - u[3] * v[0]) / x; 
				if (fabs(u[1]) > fabs(u[3]))
					pH[n + row] = -(v[0] + u[0] * pH[row]) / u[1];
				else 
					pH[n + row] = -(v[1] + u[2] * pH[row]) / u[3];
			}
		}
	}    
}

static void Complex_Division(float x,
	float y,
	float u,
	float v,
	float* a,
	float* b)
{
	float q = u*u + v*v;

	*a = (x * u + y * v) / q;
	*b = (y * u - x * v) / q;
}



static void BackSubstitute_Complex_Vector(float *H,
	float eigen_real[],
	float eigen_imag[],
	int row,
	float zero_tolerance,
	int n)
{
	float *pH;
	float *pV;
	float x, y;
	float u[4];
	float v[2];
	float w[2];
	int i, j, k;

	k = row - 1;
	pH = H + n * row;
	if (fabs(pH[k]) > fabs(pH[row - n])) {
		pH[k - n] = -(pH[row] - eigen_real[row]) / pH[k];
		pH[row - n] = -eigen_imag[row] / pH[k];
	}
	else 
		Complex_Division(-pH[row - n],
			0.0,
			pH[k - n]-eigen_real[row],
			eigen_imag[row],
			&pH[k - n],
			&pH[row - n]);
	pH[k] = 1.0;
	pH[row] = 0.0;
	for (i = row - 2, pH = H + n * i; i >= 0; pH -= n, i--) {
		u[0] = pH[i] - eigen_real[row];
		w[0] = pH[row];
		w[1] = 0.0;
		pV = H + k * n;
		for (j = k; j < row; j++, pV += n) {
			w[0] += pH[j] * pV[row - 1];
			w[1] += pH[j] * pV[row];
		}
		if (eigen_imag[i] < 0.0) {
			u[3] = u[0];
			v[0] = w[0];
			v[1] = w[1];
		}
		else {
			k = i;
			if (eigen_imag[i] == 0.0) {
				Complex_Division(-w[0],
					-w[1],
					u[0],
					eigen_imag[row],
					&pH[row - 1],
					&pH[row]);
			}
			else {
				u[1] = pH[i + 1];
				u[2] = pH[n + i];
				x = eigen_real[i] - eigen_real[row];
				y = 2.0 * x * eigen_imag[row];
				x = x * x + eigen_imag[i] * eigen_imag[i] 
				                              - eigen_imag[row] * eigen_imag[row];
				if (x == 0.0 && y == 0.0) 
					x = zero_tolerance * (fabs(u[0]) + fabs(u[1]) + fabs(u[2])
					                         + fabs(u[3]) + fabs(eigen_imag[row]));
				Complex_Division(u[1]*v[0] - u[3] * w[0] + w[1] * eigen_imag[row],
					u[1] * v[1] - u[3] * w[1] - w[0] * eigen_imag[row],
					x,
					y,
					&pH[row - 1],
					&pH[row]);
				if (fabs(u[1]) > (fabs(u[3]) + fabs(eigen_imag[row]))) {
					pH[n + row - 1] = -w[0] - u[0] * pH[row - 1]
					                            + eigen_imag[row] * pH[row] / u[1];
					pH[n + row] = -w[1] - u[0] * pH[row]
					                           - eigen_imag[row] * pH[row - 1] / u[1];
				}
				else {
					Complex_Division(-v[0] - u[2] * pH[row - 1],
						-v[1] - u[2]*pH[row],
						u[3],
						eigen_imag[row],
						&pH[n + row - 1],
						&pH[n + row]);
				}
			} 
		}
	}
}

static void BackSubstitution(float *H,
	float eigen_real[],
	float eigen_imag[],
	int n)
{
	float zero_tolerance;
	float *pH;
	int i, j, row;

	// Calculate the zero tolerance

pH = H;
	zero_tolerance = fabs(pH[0]);
	for (pH += n, i = 1; i < n; pH += n, i++)
		for (j = i - 1; j < n; j++) zero_tolerance += fabs(pH[j]);
	zero_tolerance *= DBL_EPSILON;

	// Start Backsubstitution

for(row = n - 1 ; row >= 0 ; row--) {
		if (eigen_imag[row] == 0.0) 
			BackSubstitute_Real_Vector(H,
				eigen_real,
				eigen_imag,
				row,
				zero_tolerance,
				n);
		else if (eigen_imag[row] < 0.0) 
			BackSubstitute_Complex_Vector(H,
				eigen_real,
				eigen_imag,
				row,
				zero_tolerance,
				n);
	} 
}

static void Calculate_Eigenvectors(float *H,
	float *S,
	float eigen_real[],
	float eigen_imag[],
	int n)
{
	float* pH;
	float* pS;
	float x, y;
	int i, j, k;

	for (k = n - 1; k >= 0; k--) {
		if (eigen_imag[k] < 0.0) {
			for (i = 0, pS = S; i < n; pS += n, i++) {
				x = 0.0;
				y = 0.0;
				for (j = 0, pH = H; j <= k; pH += n, j++) {
					x += pS[j] * pH[k - 1];
					y += pS[j] * pH[k];
				}
				pS[k - 1] = x;
				pS[k] = y;
			}
		}
		else if (eigen_imag[k] == 0.0) { 
			for (i = 0, pS = S; i < n; i++, pS += n) {
				x = 0.0;
				for (j = 0, pH = H; j <= k; j++, pH += n)
					x += pS[j] * pH[k];
				pS[k] = x;
			}
		}
	}
}
 
int QR_Hessenberg_Matrix( float *H,
	float *S,
	float eigen_real[],
	float eigen_imag[],
	int n,
	int max_iteration_count)
{
	int i;
	int row;
	int iteration;
	int found_eigenvalue;
	float shift = 0.0;
	float* pH;

	for (row = n - 1; row >= 0; row--) {
		found_eigenvalue = 0;
		for (iteration = 1; iteration <= max_iteration_count; iteration++) {

			// Search for small subdiagonal element

	for(i = row, pH = H + row * n ; i > 0 ; i--, pH -= n)
		if(fabs(*(pH + i - 1)) <= DBL_EPSILON *
              (fabs(*(pH - n + i - 1)) + fabs(*(pH + i)))) break;

			// If the subdiagonal element on row "row" is small, then
			// that row element is an eigenvalue.  If the subdiagonal 
			// element on row "row-1" is small, then the eigenvalues
			// of the 2x2 diagonal block consisting rows "row-1" and
			// "row" are eigenvalues.  Otherwise perform a float QR
			// iteration.
        
	 switch(row - i) {
			case 0: // One real eigenvalue
			   One_Real_Eigenvalue(pH, eigen_real, eigen_imag, i, shift);
				found_eigenvalue = 1;
				break;
			case 1: // Either two real eigenvalues or a complex pair
			   row--;
				Two_Eigenvalues(H, S, eigen_real, eigen_imag, n, row, shift);
				found_eigenvalue = 1;
				break;    
			default:
				float_QR_Iteration(H, S, i, row, n, &shift, iteration);
			}
			if (found_eigenvalue) break;
		}
		if (iteration > max_iteration_count) return -1;
	}

	BackSubstitution(H, eigen_real, eigen_imag, n);
	Calculate_Eigenvectors(H, S, eigen_real, eigen_imag, n);

	return 0;
}

void Transpose_Square_Matrix(float *A, int n) 
{
	float *pA, *pAt;
	float temp;
	int i, j;

	for (i = 0; i < n; A += n + 1, i++) {
		pA = A + 1;
		pAt = A + n;
		for (j = i + 1; j < n; pA++, pAt += n, j++) {
			temp = *pAt;
			*pAt = *pA;
			*pA = temp;
		} 
	}
}
 
void mag_calibration()
{
	int *p;
	int i, index = 0;
	float maxval, norm, btqb, hm, norm1, norm2, norm3, J, hmb = 0;
	
	int16_t total_samples = 2000;

	//float data[total_samples][3];
	int16_t data[total_samples][3];
	//float D[10 * total_samples];
	for (uint16_t i = 0; i < total_samples; i++)
	{
		MPU9250_get_mag();
		
