Captain97r/MiniCopter_STM32F103/Src/mag_caibration.c
		data[i][0] = mpu9250.magnetometer.data.x * 100;
		data[i][1] = mpu9250.magnetometer.data.y * 100;
		data[i][2] = mpu9250.magnetometer.data.z * 100;
//		x = mpu9250.magnetometer.data.x;
//		y = mpu9250.magnetometer.data.y;
//		z = mpu9250.magnetometer.data.z;
//		
//		D[i] = x * x;
//		D[total_samples + i] = y * y;
//		D[total_samples * 2 + i] = z * z;
//		D[total_samples * 3 + i] = 2.0 * y * z;
//		D[total_samples * 4 + i] = 2.0 * x * z;
//		D[total_samples * 5 + i] = 2.0 * x * y;
//		D[total_samples * 6 + i] = 2.0 * x;
//		D[total_samples * 7 + i] = 2.0 * y;
//		D[total_samples * 8 + i] = 2.0 * z;
//		D[total_samples * 9 + i] = 1.0;
		
		HAL_Delay(10);
	}
 
	// allocate memory for matrix S
	//float S[10 * 10] = { 0 };
	//Matrix_x_Its_Transpose(S, D, 10, total_samples);
	
	
	// Memory optimized Matrix_x_Its_Transpose based on measurements
	float S[10 * 10] = { 0 };
	for(uint8_t i = 0 ; i < 10 ; i++)
		for(uint8_t j = 0 ; j < 10 ; j++)
	{
		for (uint16_t n = 0; n < total_samples; n++)
		{
			float arg1, arg2 = 0;
			switch (i)
			{
			case 0:
				arg1 = (data[n][0] / 100.0) * (data[n][0] / 100.0);
				break;
			case 1:
				arg1 = (data[n][1] / 100.0) * (data[n][1] / 100.0);
				break;
			case 2:
				arg1 = (data[n][2] / 100.0) * (data[n][2] / 100.0);
				break;
			case 3:
				arg1 = 2 * (data[n][1] / 100.0) * (data[n][2] / 100.0);
				break;
			case 4:
				arg1 = 2 * (data[n][0] / 100.0) * (data[n][2] / 100.0);
				break;
			case 5:
				arg1 = 2 * (data[n][0] / 100.0) * (data[n][1] / 100.0);
				break;
			case 6:
				arg1 = 2 * (data[n][0] / 100.0);
				break;
			case 7:
				arg1 = 2 * (data[n][1] / 100.0);
				break;
			case 8:
				arg1 = 2 * (data[n][2] / 100.0);
				break;
			case 9:
				arg1 = 1.0;
				break;
			}
			switch (j)
			{
			case 0:
				arg2 = (data[n][0] / 100.0) * (data[n][0] / 100.0);
				break;
			case 1:
				arg2 = (data[n][1] / 100.0) * (data[n][1] / 100.0);
				break;
			case 2:
				arg2 = (data[n][2] / 100.0) * (data[n][2] / 100.0);
				break;
			case 3:
				arg2 = 2 * (data[n][1] / 100.0) * (data[n][2] / 100.0);
				break;
			case 4:
				arg2 = 2 * (data[n][0] / 100.0) * (data[n][2] / 100.0);
				break;
			case 5:
				arg2 = 2 * (data[n][0] / 100.0) * (data[n][1] / 100.0);
				break;
			case 6:
				arg2 = 2 * (data[n][0] / 100.0);
				break;
			case 7:
				arg2 = 2 * (data[n][1] / 100.0);
				break;
			case 8:
				arg2 = 2 * (data[n][2] / 100.0);
				break;
			case 9:
				arg2 = 1.0;
				break;
			}
			S[i * 10 + j] += arg1 * arg2;
		}
	}
	
 
	// Create pre-inverted constraint matrix C
	float C[6 * 6] = { 0 };
	C[0] = 0.0; C[1] = 0.5; C[2] = 0.5; C[3] = 0.0; C[4] = 0.0; C[5] = 0.0;
	C[6] = 0.5; C[7] = 0.0; C[8] = 0.5; C[9] = 0.0; C[10] = 0.0; C[11] = 0.0;
	C[12] = 0.5; C[13] = 0.5; C[14] = 0.0; C[15] = 0.0; C[16] = 0.0; C[17] = 0.0;
	C[18] = 0.0; C[19] = 0.0; C[20] = 0.0; C[21] = -0.25; C[22] = 0.0; C[23] = 0.0;
	C[24] = 0.0; C[25] = 0.0; C[26] = 0.0; C[27] = 0.0; C[28] = -0.25; C[29] = 0.0;
	C[30] = 0.0; C[31] = 0.0; C[32] = 0.0; C[33] = 0.0; C[34] = 0.0; C[35] = -0.25;
  
	float S11[6 * 6] = { 0 };
	Get_Submatrix(S11, 6, 6, S, 10, 0, 0);
	float S12[6 * 4] = { 0 };
	Get_Submatrix(S12, 6, 4, S, 10, 0, 6);
	float S12t[4 * 6] = { 0 };
	Get_Submatrix(S12t, 4, 6, S, 10, 6, 0);
	float S22[4 * 4] = { 0 };
	Get_Submatrix(S22, 4, 4, S, 10, 6, 6);
 
	float S22_1[4 * 4] = { 0 };
	for (i = 0; i < 16; i++)
		S22_1[i] = S22[i];
	Choleski_LU_Decomposition(S22_1, 4);
	Choleski_LU_Inverse(S22_1, 4);
 
	// Calculate S22a = S22_1 * S12t   4*6 = 4x4 * 4x6   C = AB
	float S22a[4 * 6] = { 0 };
	Multiply_Matrices(S22a, S22_1, 4, 4, S12t, 6);
 
	// Then calculate S22b = S12 * S22a      ( 6x6 = 6x4 * 4x6)
	float S22b[6 * 6] = { 0 };
	Multiply_Matrices(S22b, S12, 6, 4, S22a, 6);
 
	// Calculate SS = S11 - S22b
	float SS[6 * 6] = { 0 };
	for (i = 0; i < 36; i++)
		SS[i] = S11[i] - S22b[i];
	float E[6 * 6] = { 0 };
	Multiply_Matrices(E, C, 6, 6, SS, 6);
	
	float SSS[6 * 6] = { 0 };
	Hessenberg_Form_Elementary(E, SSS, 6);

	float eigen_real[6] = { 0 };
	float eigen_imag[6] = { 0 };

	QR_Hessenberg_Matrix(E, SSS, eigen_real, eigen_imag, 6, 100);
 
	index = 0;
	maxval = eigen_real[0];
	for (i = 1; i < 6; i++)
	{
		if (eigen_real[i] > maxval)
		{
			maxval = eigen_real[i];
			index = i;
		}
	}

	float v1[6] = { 0 };
 
	v1[0] = SSS[index]; 
	v1[1] = SSS[index + 6];
	v1[2] = SSS[index + 12];
	v1[3] = SSS[index + 18];
	v1[4] = SSS[index + 24];
	v1[5] = SSS[index + 30];

	// normalize v1
	norm = sqrt(v1[0] * v1[0] + v1[1] * v1[1] + v1[2] * v1[2] + v1[3] * v1[3] + v1[4] * v1[4] + v1[5] * v1[5]);
	v1[0] /= norm;
	v1[1] /= norm;
	v1[2] /= norm;
	v1[3] /= norm;
	v1[4] /= norm;
	v1[5] /= norm;

	if (v1[0] < 0.0)
	{
		v1[0] = -v1[0];
		v1[1] = -v1[1];
		v1[2] = -v1[2];
		v1[3] = -v1[3];
		v1[4] = -v1[4];
		v1[5] = -v1[5];
	}

	// Calculate v2 = S22a * v1      ( 4x1 = 4x6 * 6x1)
	float v2[4] = { 0 };
	Multiply_Matrices(v2, S22a, 4, 6, v1, 1);

	float v[10] = { 0 };

	v[0] = v1[0];
	v[1] = v1[1];
	v[2] = v1[2];
	v[3] = v1[3];
	v[4] = v1[4];
	v[5] = v1[5];
	v[6] = -v2[0];
	v[7] = -v2[1];
	v[8] = -v2[2];
	v[9] = -v2[3];

	float Q[3 * 3] = { 0 };
 
	Q[0] = v[0];
	Q[1] = v[5];
	Q[2] = v[4];
	Q[3] = v[5];
	Q[4] = v[1];
	Q[5] = v[3];
	Q[6] = v[4];
	Q[7] = v[3];
	Q[8] = v[2];

	float U[3] = { 0 };

	U[0] = v[6];
	U[1] = v[7];
	U[2] = v[8];

	float Q_1[3 * 3] = { 0 };
	for (i = 0; i < 9; i++)
		Q_1[i] = Q[i];
	Choleski_LU_Decomposition(Q_1, 3);
	Choleski_LU_Inverse(Q_1, 3);
	
	// Calculate B = Q-1 * U   ( 3x1 = 3x3 * 3x1)
	float B[3] = { 0 };
	Multiply_Matrices(B, Q_1, 3, 3, U, 1);
	
	mpu9250.magnetometer.offset.x = -B[0];     // x-axis combined bias
	mpu9250.magnetometer.offset.y = -B[1];     // y-axis combined bias
	mpu9250.magnetometer.offset.z = -B[2];     // z-axis combined bias
 
	// First calculate QB = Q * B   ( 3x1 = 3x3 * 3x1)
	float QB[3] = { 0 };
	Multiply_Matrices(QB, Q, 3, 3, B, 1);

	// Then calculate btqb = BT * QB    ( 1x1 = 1x3 * 3x1)
	Multiply_Matrices(&btqb, B, 1, 3, QB, 1);

	// Calculate hmb = sqrt(btqb - J).
	J = v[9];
	hmb = sqrt(btqb - J);

	// Calculate SQ, the square root of matrix Q
	float SSSS[3 * 3] = { 0 };
	Hessenberg_Form_Elementary(Q, SSSS, 3);

	float eigen_real3[3] = { 0 };
	float eigen_imag3[3] = { 0 };
	QR_Hessenberg_Matrix(Q, SSSS, eigen_real3, eigen_imag3, 3, 100);

