Captain97r/MiniCopter_STM32F103/Src/mag_caibration.c
	// normalize eigenvectors
	norm1 = sqrt(SSSS[0] * SSSS[0] + SSSS[3] * SSSS[3] + SSSS[6] * SSSS[6]);
	SSSS[0] /= norm1;
	SSSS[3] /= norm1;
	SSSS[6] /= norm1;
	norm2 = sqrt(SSSS[1] * SSSS[1] + SSSS[4] * SSSS[4] + SSSS[7] * SSSS[7]);
	SSSS[1] /= norm2;
	SSSS[4] /= norm2;
	SSSS[7] /= norm2;
	norm3 = sqrt(SSSS[2] * SSSS[2] + SSSS[5] * SSSS[5] + SSSS[8] * SSSS[8]);
	SSSS[2] /= norm3;
	SSSS[5] /= norm3;
	SSSS[8] /= norm3;
 
	float Dz[3 * 3] = { 0 };
	for (i = 0; i < 9; i++)
		Dz[i] = 0.0;
	Dz[0] = sqrt(eigen_real3[0]);
	Dz[4] = sqrt(eigen_real3[1]);
	Dz[8] = sqrt(eigen_real3[2]);

	float vdz[3 * 3] = { 0 };
	Multiply_Matrices(vdz, SSSS, 3, 3, Dz, 3);

	Transpose_Square_Matrix(SSSS, 3);

	float SQ[3 * 3] = { 0 };
	Multiply_Matrices(SQ, vdz, 3, 3, SSSS, 3);

	// radius
	float x_m = 0, y_m = 0, z_m = 0;
	for (uint16_t k = 0; k < total_samples; k++)
	{
		x_m += (data[0][k] / 100.0);
		y_m += (data[1][k] / 100.0);
		z_m += (data[2][k] / 100.0);
	}
	x_m /= total_samples;
	y_m /= total_samples;
	z_m /= total_samples;
	
	x_m *= 100;
	y_m *= 100;
	z_m *= 100;
	
	for (uint16_t k = 0; k < total_samples; k++)
	{
		data[0][k] -= x_m;
		data[1][k] -= y_m;
		data[2][k] -= z_m;
	}
	
	float data_squared[total_samples / 10][3];
	for (uint16_t k = 0; k < total_samples; k += 10)
	{
		data_squared[0][k / 10] = (data[0][k] / 100.0) * (data[0][k] / 100.0);
		data_squared[1][k / 10] = (data[1][k] / 100.0) * (data[1][k] / 100.0);
		data_squared[2][k / 10] = (data[2][k] / 100.0) * (data[2][k] / 100.0);
	}
	
	double r_m = 0;
	for (uint16_t k = 0; k < total_samples / 10; k++)
	{
		r_m += sqrt(data_squared[0][k] + data_squared[1][k] + data_squared[2][k]);
	}
	
	hm = (r_m / (total_samples / 10.0));
	//hm = 59;
	
	for (uint8_t i = 0; i < 3; i++)
		for (uint8_t j = 0; j < 3; j++)
			mpu9250.magnetometer.dcm[i][j] = SQ[i * 3 + j] * hm / hmb;

}